<a href="https://colab.research.google.com/github/AgnieszkaBorys/data-science-bootcamp/blob/master/02_analiza_danych/02_dane_gieldowe.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

CASE STUDY - DANE GIEŁDOWE

IMPORT BIBLIOTEK

In [2]:
import numpy as np
import pandas as pd

print(f'Numpy: {np.__version__}')
print(f'Pandas: {pd.__version__}')

Numpy: 1.18.4
Pandas: 1.0.3

ZAŁADOWANIE DANYCH

In [8]:
def fetch_financial_data(company='AMZN'):
  """Pobiera dane dotyczące notowań spółek na giełdzie według symboli na serwisie stooq.pl"""
  import pandas_datareader.data as web
  return web.DataReader(name=company, data_source='stooq')

df = fetch_financial_data()
df.info()

/usr/local/lib/python3.6/dist-packages/pandas_datareader/compat/__init__.py:7: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  from pandas.util.testing import assert_frame_equal

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 1258 entries, 2020-05-07 to 2015-05-11
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Open    1258 non-null   float64
 1   High    1258 non-null   float64
 2   Low     1258 non-null   float64
 3   Close   1258 non-null   float64
 4   Volume  1258 non-null   int64
dtypes: float64(4), int64(1)
memory usage: 59.0 KB

EKSPLORACJA DANYCH

In [9]:
df

               Open     High        Low    Close   Volume
Date
2020-05-07  2374.78  2376.00  2343.1100  2367.61  3396411
2020-05-06  2329.44  2357.45  2320.0000  2351.26  3117814
2020-05-05  2340.00  2351.00  2307.1251  2317.80  3242496
2020-05-04  2256.38  2326.98  2256.3800  2315.99  4865926
2020-05-01  2336.80  2362.44  2258.1901  2286.04  9772605
...             ...      ...        ...      ...      ...
2015-05-15   428.00   430.40   424.3000   426.00  4240281
2015-05-14   429.45   433.00   427.0100   432.28  1888400
2015-05-13   429.58   433.53   425.8000   426.87  1996328
2015-05-12   431.08   433.25   426.7100   431.02  1947817
2015-05-11   432.52   439.00   431.3700   432.85  2393700

[1258 rows x 5 columns]

In [11]:
df.head(10)  #ostatnie 10 obiektów

               Open       High        Low    Close   Volume
Date
2020-05-07  2374.78  2376.0000  2343.1100  2367.61  3396411
2020-05-06  2329.44  2357.4500  2320.0000  2351.26  3117814
2020-05-05  2340.00  2351.0000  2307.1251  2317.80  3242496
2020-05-04  2256.38  2326.9800  2256.3800  2315.99  4865926
2020-05-01  2336.80  2362.4400  2258.1901  2286.04  9772605
2020-04-30  2419.84  2475.0000  2396.0100  2474.00  9534611
2020-04-29  2330.01  2391.8900  2310.0000  2372.71  4591593
2020-04-28  2372.10  2373.5000  2306.0000  2314.08  5269446
2020-04-27  2443.20  2444.8800  2363.0000  2376.00  5645645
2020-04-24  2417.00  2420.4332  2382.0000  2410.22  3831797

In [12]:
df.tail(10)

              Open    High     Low   Close   Volume
Date
2015-05-22  431.55  432.44  427.61  427.63  2020600
2015-05-21  428.00  436.90  428.00  431.63  4121400
2015-05-20  420.60  427.10  418.36  423.86  2196159
2015-05-19  424.94  428.24  420.63  421.71  2465240
2015-05-18  426.00  427.27  421.46  425.24  2389462
2015-05-15  428.00  430.40  424.30  426.00  4240281
2015-05-14  429.45  433.00  427.01  432.28  1888400
2015-05-13  429.58  433.53  425.80  426.87  1996328
2015-05-12  431.08  433.25  426.71  431.02  1947817
2015-05-11  432.52  439.00  431.37  432.85  2393700

In [13]:
df.columns

Index(['Open', 'High', 'Low', 'Close', 'Volume'], dtype='object')

In [0]:
df.columns = [col.lower() for col in df.columns]

In [15]:
df.head()

               open     high        low    close   volume
Date
2020-05-07  2374.78  2376.00  2343.1100  2367.61  3396411
2020-05-06  2329.44  2357.45  2320.0000  2351.26  3117814
2020-05-05  2340.00  2351.00  2307.1251  2317.80  3242496
2020-05-04  2256.38  2326.98  2256.3800  2315.99  4865926
2020-05-01  2336.80  2362.44  2258.1901  2286.04  9772605

In [16]:
df.describe()

              open         high          low        close        volume
count  1258.000000  1258.000000  1258.000000  1258.000000  1.258000e+03
mean   1231.363907  1243.325757  1217.802845  1231.251045  4.202311e+06
std     539.524643   545.630430   532.945503   539.591418  2.222173e+06
min     420.600000   426.800000   418.360000   421.710000  8.813370e+05
25%     752.732500   757.815000   744.397500   751.080000  2.714950e+06
50%    1109.075000  1124.100000  1104.945000  1116.130000  3.639696e+06
75%    1764.307500  1779.225000  1745.387500  1764.195000  4.953428e+06
max    2443.200000  2475.000000  2396.010000  2474.000000  2.190930e+07

In [17]:
df.describe().T

         count          mean  ...           75%          max
open    1258.0  1.231364e+03  ...  1.764307e+03      2443.20
high    1258.0  1.243326e+03  ...  1.779225e+03      2475.00
low     1258.0  1.217803e+03  ...  1.745387e+03      2396.01
close   1258.0  1.231251e+03  ...  1.764195e+03      2474.00
volume  1258.0  4.202311e+06  ...  4.953428e+06  21909300.00

[5 rows x 8 columns]

SELEKCJA KOLUMN

In [19]:
df = df.head(10)
df

               open       high        low    close   volume
Date
2020-05-07  2374.78  2376.0000  2343.1100  2367.61  3396411
2020-05-06  2329.44  2357.4500  2320.0000  2351.26  3117814
2020-05-05  2340.00  2351.0000  2307.1251  2317.80  3242496
2020-05-04  2256.38  2326.9800  2256.3800  2315.99  4865926
2020-05-01  2336.80  2362.4400  2258.1901  2286.04  9772605
2020-04-30  2419.84  2475.0000  2396.0100  2474.00  9534611
2020-04-29  2330.01  2391.8900  2310.0000  2372.71  4591593
2020-04-28  2372.10  2373.5000  2306.0000  2314.08  5269446
2020-04-27  2443.20  2444.8800  2363.0000  2376.00  5645645
2020-04-24  2417.00  2420.4332  2382.0000  2410.22  3831797

In [20]:
df['open']

Date
2020-05-07    2374.78
2020-05-06    2329.44
2020-05-05    2340.00
2020-05-04    2256.38
2020-05-01    2336.80
2020-04-30    2419.84
2020-04-29    2330.01
2020-04-28    2372.10
2020-04-27    2443.20
2020-04-24    2417.00
Name: open, dtype: float64

In [21]:
df.open

Date
2020-05-07    2374.78
2020-05-06    2329.44
2020-05-05    2340.00
2020-05-04    2256.38
2020-05-01    2336.80
2020-04-30    2419.84
2020-04-29    2330.01
2020-04-28    2372.10
2020-04-27    2443.20
2020-04-24    2417.00
Name: open, dtype: float64

In [23]:
df[['open', 'close']]

               open    close
Date
2020-05-07  2374.78  2367.61
2020-05-06  2329.44  2351.26
2020-05-05  2340.00  2317.80
2020-05-04  2256.38  2315.99
2020-05-01  2336.80  2286.04
2020-04-30  2419.84  2474.00
2020-04-29  2330.01  2372.71
2020-04-28  2372.10  2314.08
2020-04-27  2443.20  2376.00
2020-04-24  2417.00  2410.22

In [25]:
df.iloc[:, 0]

Date
2020-05-07    2374.78
2020-05-06    2329.44
2020-05-05    2340.00
2020-05-04    2256.38
2020-05-01    2336.80
2020-04-30    2419.84
2020-04-29    2330.01
2020-04-28    2372.10
2020-04-27    2443.20
2020-04-24    2417.00
Name: open, dtype: float64

In [26]:
df.iloc[:, [0,3]]

               open    close
Date
2020-05-07  2374.78  2367.61
2020-05-06  2329.44  2351.26
2020-05-05  2340.00  2317.80
2020-05-04  2256.38  2315.99
2020-05-01  2336.80  2286.04
2020-04-30  2419.84  2474.00
2020-04-29  2330.01  2372.71
2020-04-28  2372.10  2314.08
2020-04-27  2443.20  2376.00
2020-04-24  2417.00  2410.22

In [27]:
df.iloc[:, 3:5]

              close   volume
Date
2020-05-07  2367.61  3396411
2020-05-06  2351.26  3117814
2020-05-05  2317.80  3242496
2020-05-04  2315.99  4865926
2020-05-01  2286.04  9772605
2020-04-30  2474.00  9534611
2020-04-29  2372.71  4591593
2020-04-28  2314.08  5269446
2020-04-27  2376.00  5645645
2020-04-24  2410.22  3831797

In [28]:
df.iloc[:, -1]

Date
2020-05-07    3396411
2020-05-06    3117814
2020-05-05    3242496
2020-05-04    4865926
2020-05-01    9772605
2020-04-30    9534611
2020-04-29    4591593
2020-04-28    5269446
2020-04-27    5645645
2020-04-24    3831797
Name: volume, dtype: int64

In [29]:
df.iloc[:, [-1]]

             volume
Date
2020-05-07  3396411
2020-05-06  3117814
2020-05-05  3242496
2020-05-04  4865926
2020-05-01  9772605
2020-04-30  9534611
2020-04-29  4591593
2020-04-28  5269446
2020-04-27  5645645
2020-04-24  3831797

In [31]:
df.iloc[:, -2:]

              close   volume
Date
2020-05-07  2367.61  3396411
2020-05-06  2351.26  3117814
2020-05-05  2317.80  3242496
2020-05-04  2315.99  4865926
2020-05-01  2286.04  9772605
2020-04-30  2474.00  9534611
2020-04-29  2372.71  4591593
2020-04-28  2314.08  5269446
2020-04-27  2376.00  5645645
2020-04-24  2410.22  3831797

SELEKCJA WIERSZY

In [32]:
df.iloc[0]

open         2374.78
high         2376.00
low          2343.11
close        2367.61
volume    3396411.00
Name: 2020-05-07 00:00:00, dtype: float64

In [33]:
df.iloc[:3]

               open     high        low    close   volume
Date
2020-05-07  2374.78  2376.00  2343.1100  2367.61  3396411
2020-05-06  2329.44  2357.45  2320.0000  2351.26  3117814
2020-05-05  2340.00  2351.00  2307.1251  2317.80  3242496

In [34]:
df.loc['2020-05-07']

               open    high      low    close   volume
Date
2020-05-07  2374.78  2376.0  2343.11  2367.61  3396411

In [35]:
df.loc['2020-05-07': '2020-05-01']

               open     high        low    close   volume
Date
2020-05-07  2374.78  2376.00  2343.1100  2367.61  3396411
2020-05-06  2329.44  2357.45  2320.0000  2351.26  3117814
2020-05-05  2340.00  2351.00  2307.1251  2317.80  3242496
2020-05-04  2256.38  2326.98  2256.3800  2315.99  4865926
2020-05-01  2336.80  2362.44  2258.1901  2286.04  9772605

OBLICZANIE NOWYCH KOLUMN

In [37]:
df = fetch_financial_data('UBER')
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 251 entries, 2020-05-07 to 2019-05-10
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Open    251 non-null    float64
 1   High    251 non-null    float64
 2   Low     251 non-null    float64
 3   Close   251 non-null    float64
 4   Volume  251 non-null    int64
dtypes: float64(4), int64(1)
memory usage: 11.8 KB

In [38]:
df.head()

             Open     High     Low  Close    Volume
Date
2020-05-07  29.60  31.6500  29.580  30.93  62229496
2020-05-06  27.50  28.0600  26.810  27.82  31076451
2020-05-05  28.25  28.9088  27.440  28.07  30725371
2020-05-04  27.56  28.0700  26.580  27.42  23428333
2020-05-01  29.13  29.7200  28.325  28.39  19290192

In [39]:
df.tail()

             Open   High    Low  Close     Volume
Date
2019-05-16  41.48  44.06  41.25  43.00   38115524
2019-05-15  39.37  41.88  38.95  41.29   36086065
2019-05-14  38.31  39.96  36.85  39.96   46661147
2019-05-13  38.79  39.24  36.08  37.10   79442420
2019-05-10  42.00  45.00  41.06  41.57  186322536

In [40]:
df.describe().T

        count          mean  ...           75%           max
Open    251.0  3.412537e+01  ...  4.016000e+01  4.698000e+01
High    251.0  3.482341e+01  ...  4.094500e+01  4.708000e+01
Low     251.0  3.330200e+01  ...  3.943000e+01  4.508000e+01
Close   251.0  3.408223e+01  ...  4.013500e+01  4.638000e+01
Volume  251.0  2.502399e+07  ...  3.439483e+07  1.863225e+08

[5 rows x 8 columns]